tap "fwartner/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
tap "sidneys/homebrew"

brew "lz4"
brew "libssh2"
brew "readline"
brew "aria2"
brew "automake"
brew "cabextract"
brew "freetype"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "ccache"
brew "cdrtools"
brew "cmake"
brew "dpkg"
brew "fakeroot"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "opus"
brew "libvpx"
brew "ffmpeg"
brew "ffmpeg@4"
brew "git"
brew "gnupg"
brew "go"
brew "python@3.11"
brew "gobject-introspection"
brew "gperf"
brew "gsl"
brew "libtool"
brew "guile"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libmicrohttpd"
brew "libssh"
brew "libusbmuxd"
brew "mas"
brew "midnight-commander"
brew "mkcert"
brew "mockery"
brew "nghttp2"
brew "ninja"
brew "node"
brew "nss"
brew "numpy"
brew "nvm"
brew "vtk"
brew "opencv"
brew "openjdk"
brew "osslsigncode"
brew "pinentry-mac"
brew "pipenv"
brew "portaudio"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "srtp"
brew "telnet"
brew "tmux"
brew "tree"
brew "vegeta"
brew "watch"
brew "wget"
brew "wimlib"
brew "winetricks"
brew "yarn"
brew "yasm"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"

cask "basictex"
cask "ngrok"
cask "nightfall"
cask "temurin"
cask "wine-crossover"
cask "wireshark"
cask "the-unarchiver"
cask "readdle-spark"
cask "slack"
cask "zoom"
cask "telegram"

mas "AdBlock Pro", id: 1018301773
mas "GoodNotes", id: 1444383602
mas "iStat Menus", id: 1319778037
mas "Magnet", id: 441258766
mas "Recess", id: 621451282
mas "TextSniper", id: 1528890965
mas "Xcode", id: 497799835
